tap "jandedobbeleer/oh-my-posh"
tap "tsonglew/dutis"
tap "qmk/qmk"
tap "shkm/brew"
tap "timrogers/tap"

# Shell & Terminal
brew "fish"
brew "jandedobbeleer/oh-my-posh/oh-my-posh"
brew "zoxide"
brew "bat"
brew "eza"
brew "fd"
brew "fzf"
brew "bottom"
brew "procs"
brew "broot"
brew "yazi"
brew "tealdeer"
brew "sd"
brew "watch"
brew "dark-mode"

# Disk usage
brew "dust"
brew "duf"
brew "dua-cli"
brew "ncdu"
brew "diskonaut"

# Dev tools
brew "overmind"
brew "mise"
brew "tig"
brew "git"
brew "git-delta"
brew "gh"
brew "lazygit"
brew "neovim"
brew "tree-sitter-cli"
brew "stow"
brew "stylua"
brew "shellcheck"
brew "watchexec"
brew "fswatch"

# Languages & Package Managers
brew "go"
brew "elixir-ls"
brew "pnpm"

# Containers & Infra
brew "docker"
brew "docker-compose"
brew "dive"

# Networking
brew "curl"
brew "wget"
brew "httpie"
brew "aria2"
brew "doggo"
brew "gping"
brew "mtr"
brew "nmap"
brew "websocat"
brew "swaks"

# Media & Images
brew "ffmpeg"
brew "imagemagick-full"
brew "graphicsmagick"
brew "vips"
brew "mcat"

# Documents
brew "pandoc"

# Security
brew "mkcert"

# macOS utilities
brew "fileicon"
brew "terminal-notifier"
brew "xcodegen"
brew "tsonglew/dutis/dutis"

# Hardware
brew "shkm/brew/camera-hook"
brew "timrogers/tap/litra"

# Misc CLI tools
brew "topgrade"
brew "translate-shell"
brew "exiftool"
brew "llm"
brew "ntfy"
brew "rsync"
brew "ouch"
brew "rbspy"
brew "fx"

# Fun
brew "cowsay"
brew "cfonts"
brew "figlet"

# Casks -- Apps
cask "claude-code"
cask "ghostty"
cask "github"
cask "google-chrome"
cask "hammerspoon"
cask "itsycal"
cask "kitty"
cask "neovide-app"
cask "linearmouse"
cask "qobuz"
cask "slack"
cask "sublime-merge"
cask "zed"
cask "zoom"

# Casks -- Browsers
cask "firefox"
cask "orion"
cask "vivaldi"

# Casks -- Utilities
cask "affinity"
cask "cyberduck"
cask "keka"
cask "kekaexternalhelper"
cask "keyboardcleantool"
cask "pearcleaner"
cask "vlc"

# Casks -- Fonts
cask "font-0xproto-nerd-font"
